Catalogs/НП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Квалификация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Квалификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Квалификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Квалификация</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бакалавриат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Специалитет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магистратура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НП/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Наим = ЭтотОбъект.Наименование;
	Если 
		ЭтотОбъект.Квалификация = Перечисления.Квалификация.Магистратура
		И НЕ СтрНайти(Наим, "(маг.)")
	Тогда
		ЭтотОбъект.Наименование = Наим + " (маг.)";
	ИначеЕсли
		ЭтотОбъект.Квалификация = Перечисления.Квалификация.Специалитет
		И НЕ СтрНайти(Наим, "(спец.)")
	Тогда
		ЭтотОбъект.Наименование = Наим + " (спец.)";	
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ Справочник.НП
	|ГДЕ Наименование = &Наименование
	|	И Квалификация = &Квалификация
	|"); 
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("Квалификация", ЭтотОбъект.Квалификация);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат[0].Количество > 0 Тогда
		Сообщить("НП с таким наименованием и квалификацией уже существует!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
